// Завдання 1. Підрахунок категорій та елементів в кожній категорії.

/* ============================================================================================= */
// HTML містить список категорій ul#categories.
/* --------------------------------------------------------------------------------------------- */
// З використанням властивостей і методів DOM-елементів, напиши скрипт, який:

// Порахує й виведе в консоль кількість категорій в ul#categories, тобто елементів li.item.
// Для кожного елемента li.item у списку ul#categories знайде й виведе в консоль текст заголовка 
// елемента (тегу <h2>) і кількість елементів у категорії (усіх <li>, вкладених у нього).
/* --------------------------------------------------------------------------------------------- */
// На що буде звертати увагу ментор при перевірці:
// Кількість категорій, їх назва та кількість елементів отримані за допомогою властивостей і методів DOM-елементів
// Дані за кожною категорією були отримані й виведені в консоль у тілі циклу або методу forEach()
/* --------------------------------------------------------------------------------------------- */

// Знаходимо всі елементи категорій
const categories = document.querySelectorAll('#categories .item');
// Підраховуємо кількість категорій
const countCategories = categories.length;
// Виводимо кількість категорій
console.log(`Number of categories:`,countCategories);

categories.forEach((category) => {
    // Пошук в категорії заголовка h2
    const categoryTitle = category.querySelector('h2');
    // Виводимо текстовий контент заголовка
    console.log('Category:', categoryTitle.textContent);
    // Пошук всіх елементів в категорії
    const elements = category.querySelectorAll('li');
    // Підраховуємо кількість елементів
    const countElements = elements.length;
    // Виводимо кількість елементів
    console.log(`Elements:`, countElements);
});




