// Завдання 4.

/* ============================================================================================= */
// Напиши скрипт управління формою логіна.
/* --------------------------------------------------------------------------------------------- */
// 1. Відправлення форми form.login-form повинна відбуватися за подією submit.
// 2. Під час відправлення форми сторінка не повинна перезавантажуватися.
// 3. Якщо при сабміті у формі є незаповнені поля, виводь alert з попередженням про те, що 'All form fields must be filled in'. Не додавай на інпути атрибут required, валідація має відбуватися саме через JS.
// 4. Якщо користувач заповнив усі поля і відправив форму, збери значення полів в об'єкт з двома властивостями, де ключ — це ім'я інпутів, а значення — відповідні значення цих інпутів, очищені від пробілів по краях. Для доступу до елементів форми використовуй властивість elements.
// 5. При сабміті форми виведи об'єкт із введеними даними в консоль і очисти значення полів форми методом reset.

/* --------------------------------------------------------------------------------------------- */
// На що буде звертати увагу ментор при перевірці:

//   Прослуховується подія submit
//   Під час відправлення форми сторінка не перезавантажується
//   Якщо при сабміті у формі є незаповнені поля, виводиться alert
//   При сабміті в консоль виводиться об’єкт з двома властивостями, де ключі — це ім’я інпутів, а значення — відповідні значення цих інпутів, очищені від пробілів по краях
//   Після сабміту елементи форми очищаються
/* --------------------------------------------------------------------------------------------- */

// Елемент - форма реєстрації
const loginForm = document.querySelector('.login-form');
// console.log(`loginForm`, loginForm);

/* --------------------------------------------------------------------------------------------- */
// Для Варіанта 2 знаходимо 2 елементи вводу інформації від користувача
// Елемент - поле ввода (input) email (за селектором значення атрибуту)
const inputEmail = document.querySelector('[name="email"]');
// console.log(`inputEmail`, inputEmail);

// Елемент - поле ввода (input) password (за селектором значення атрибуту)
const inputPassword = document.querySelector('[name="password"]');
// console.log(`inputPassword`, inputPassword);
/* --------------------------------------------------------------------------------------------- */

// Встановлюємо слухача подій на форму (при натисканні на кнопку type="submit")
loginForm.addEventListener('submit', onSubmitLoginForm);

// Функція - обробник події submit
function onSubmitLoginForm(event) {

  // Скасовуємо дефолтну дію перезавантаження сторінки
  event.preventDefault();

  /* --------------------------------------------------------------------------------------------- */
  // Варіант 1 - отримання посилань та значень input згідно  event

  // Отримуємо посилання на форму
  const myForm = event.target;
    // Видаляємо зовнішні пробіли та перезаписуємо значення input
  myForm.elements.email.value = myForm.elements.email.value.trim();
  const newEmail = myForm.elements.email.value;

  myForm.elements.password.value = myForm.elements.password.value.trim();
  const newPassword = myForm.elements.password.value;
/* --------------------------------------------------------------------------------------------- */

/* --------------------------------------------------------------------------------------------- */
//   Варіант 2 - отримання посилань та значень input згідно знайдених елементів

  // Видаляємо зовнішні пробіли та перезаписуємо значення input
  // inputEmail.value = inputEmail.value.trim();
  // const newEmail = inputEmail.value;
  // console.log(`newEmail`, newEmail, newEmail.length);

  // inputPassword.value = inputPassword.value.trim();
  // const newPassword = inputPassword.value;
  // console.log(`newPassword`, newPassword, newPassword.length);
/* --------------------------------------------------------------------------------------------- */

  // Перевірка на непусті значення введених даних
  if (newEmail === '' || newPassword === '') {
    alert('All form fields must be filled in');
    return;
  }
  // Створення об'єкту з інформацією користувача
  const userInfo = {
    email: newEmail,
    password: newPassword,
  };
  // Виведення в консоль об'єкта з інформацією користувача
  console.log(`userInfo`, userInfo);


  // очистка значення полів форми

  // За варіантом 1
   myForm.reset();

  //  За варіантом 2
  // loginForm.reset();

}
