// Завдання 3. 

/* ============================================================================================= */
// Напиши скрипт, який під час набору тексту в інпуті input#name-input (подія input) 
// підставляє його поточне значення в span#name-output як ім’я для привітання. 
// Обов’язково очищай значення в інпуті по краях від пробілів. 
// Якщо інпут порожній або містить лише пробіли, то замість імені у спан має підставлятися рядок "Anonymous".
/* --------------------------------------------------------------------------------------------- */
// На що буде звертати увагу ментор при перевірці:

//   На елементі input#name-input прослуховується подія input
//   Під час набору тексту в інпуті його поточне значення підставляється в span#name-output як ім’я для привітання
//   Значення в інпуті очищене від пробілів по краях
//   Якщо інпут порожній або містить лише пробіли, то замість імені у спан має підставлятися рядок "Anonymous"
/* --------------------------------------------------------------------------------------------- */

// елемент input для задавання імені
const elNameInput = document.querySelector('#name-input');

// елемент span для виведення значення на екран
const elNameOutput = document.querySelector('#name-output');

console.log(`elNameInput`,elNameInput);
console.log(`elNameOutput`,elNameOutput);

// Встановлюємо слухач події input на елемент #name-input
elNameInput.addEventListener('input', outputName);

// Функція - обробник події
function outputName(event) {

    // Значення, введене в #name-input, очищене від пробілів по краях
    let newName = event.currentTarget.value.trim();

    // Перевірка, що значення не порожнє (бо всі пробіли вже видалені)
    if (newName.length === 0) {
        newName = 'Anonymous';
    }

    // підставляється поточне значення #name-input в span#name-output
    elNameOutput.textContent = newName;
}
